{"backend": "tensorflow", "keras_version": "2.0.4", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_shape": null, "output_mask": null, "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": false, "activity_regularizer": null, "output_dim": 300, "input_dim": 95597, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_regularizer": null, "batch_input_shape": [null, 40], "dtype": "int32", "mask_zero": false, "input_length": 40, "embeddings_constraint": null, "name": "embedding_1"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1"}}, "name": "time_distributed_1"}}, {"class_name": "Lambda", "config": {"trainable": true, "output_shape": [300], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S)\u0003N\u00da\u0004axis\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0003sum)\u0001\u00da\u0001x\u00a9\u0000r\u0006\u0000\u0000\u0000\u00fa\u0006rnn.py\u00da\b<lambda>\u009c\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "name": "lambda_1"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": false, "activity_regularizer": null, "output_dim": 300, "input_dim": 95597, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_regularizer": null, "batch_input_shape": [null, 40], "dtype": "int32", "mask_zero": false, "input_length": 40, "embeddings_constraint": null, "name": "embedding_2"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2"}}, "name": "time_distributed_2"}}, {"class_name": "Lambda", "config": {"trainable": true, "output_shape": [300], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S)\u0003N\u00da\u0004axis\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0003sum)\u0001\u00da\u0001x\u00a9\u0000r\u0006\u0000\u0000\u0000\u00fa\u0006rnn.py\u00da\b<lambda>\u00a6\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "name": "lambda_2"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": false, "activity_regularizer": null, "output_dim": 300, "input_dim": 95597, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_regularizer": null, "batch_input_shape": [null, 40], "dtype": "int32", "mask_zero": false, "input_length": 40, "embeddings_constraint": null, "name": "embedding_3"}}, {"class_name": "Conv1D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1], "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "filters": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "kernel_size": [5], "name": "conv1d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "Conv1D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1], "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "filters": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "kernel_size": [5], "name": "conv1d_2"}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_3"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "name": "batch_normalization_1"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": false, "activity_regularizer": null, "output_dim": 300, "input_dim": 95597, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_regularizer": null, "batch_input_shape": [null, 40], "dtype": "int32", "mask_zero": false, "input_length": 40, "embeddings_constraint": null, "name": "embedding_4"}}, {"class_name": "Conv1D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1], "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "filters": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "kernel_size": [5], "name": "conv1d_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_4"}}, {"class_name": "Conv1D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1], "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "filters": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "kernel_size": [5], "name": "conv1d_4"}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_6"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "name": "batch_normalization_2"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "activity_regularizer": null, "output_dim": 300, "input_dim": 95597, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_regularizer": null, "batch_input_shape": [null, 40], "dtype": "int32", "mask_zero": false, "input_length": 40, "embeddings_constraint": null, "name": "embedding_5"}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "recurrent_dropout": 0.2, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "use_bias": true, "activation": "tanh", "kernel_constraint": null, "go_backwards": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "dropout": 0.2, "unit_forget_bias": true, "bias_regularizer": null, "unroll": false, "stateful": false, "activity_regularizer": null, "recurrent_regularizer": null, "units": 300, "name": "lstm_1"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "activity_regularizer": null, "output_dim": 300, "input_dim": 95597, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_regularizer": null, "batch_input_shape": [null, 40], "dtype": "int32", "mask_zero": false, "input_length": 40, "embeddings_constraint": null, "name": "embedding_6"}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "recurrent_dropout": 0.2, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "use_bias": true, "activation": "tanh", "kernel_constraint": null, "go_backwards": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "dropout": 0.2, "unit_forget_bias": true, "bias_regularizer": null, "unroll": false, "stateful": false, "activity_regularizer": null, "recurrent_regularizer": null, "units": 300, "name": "lstm_2"}}]}], "concat_axis": -1, "mode_type": "raw", "output_shape_type": "raw", "output_mask_type": "raw", "dot_axes": -1, "arguments": {}, "name": "merge_1"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5"}}, {"class_name": "PReLU", "config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_7"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6"}}, {"class_name": "PReLU", "config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_8"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_7"}}, {"class_name": "PReLU", "config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_9"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_8"}}, {"class_name": "PReLU", "config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_10"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_9"}}, {"class_name": "PReLU", "config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_11"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_10"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}]}