{"config": [{"config": {"mode": "concat", "concat_axis": -1, "output_mask_type": "raw", "name": "merge_1", "mode_type": "raw", "layers": [{"config": [{"config": {"embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "dtype": "int32", "input_dim": 95597, "name": "embedding_1", "mask_zero": false, "trainable": false, "output_dim": 300, "embeddings_constraint": null, "embeddings_regularizer": null, "input_length": 40, "batch_input_shape": [null, 40]}, "class_name": "Embedding"}, {"config": {"layer": {"config": {"activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, "name": "time_distributed_1", "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"function_type": "lambda", "name": "lambda_1", "trainable": true, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S)\u0003N\u00da\u0004axis\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0003sum)\u0001\u00da\u0001x\u00a9\u0000r\u0006\u0000\u0000\u0000\u00fa\u0006rnn.py\u00da\b<lambda>\u009c\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": [300]}, "class_name": "Lambda"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "dtype": "int32", "input_dim": 95597, "name": "embedding_2", "mask_zero": false, "trainable": false, "output_dim": 300, "embeddings_constraint": null, "embeddings_regularizer": null, "input_length": 40, "batch_input_shape": [null, 40]}, "class_name": "Embedding"}, {"config": {"layer": {"config": {"activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, "name": "time_distributed_2", "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"function_type": "lambda", "name": "lambda_2", "trainable": true, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S)\u0003N\u00da\u0004axis\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0003sum)\u0001\u00da\u0001x\u00a9\u0000r\u0006\u0000\u0000\u0000\u00fa\u0006rnn.py\u00da\b<lambda>\u00a6\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": [300]}, "class_name": "Lambda"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "dtype": "int32", "input_dim": 95597, "name": "embedding_3", "mask_zero": false, "trainable": false, "output_dim": 300, "embeddings_constraint": null, "embeddings_regularizer": null, "input_length": 40, "batch_input_shape": [null, 40]}, "class_name": "Embedding"}, {"config": {"padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "strides": [1], "kernel_size": [5], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv1d_1", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "trainable": true, "filters": 64}, "class_name": "Conv1D"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "strides": [1], "kernel_size": [5], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv1d_2", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "trainable": true, "filters": 64}, "class_name": "Conv1D"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"rate": 0.2, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_3", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.2, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_1", "beta_regularizer": null, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "dtype": "int32", "input_dim": 95597, "name": "embedding_4", "mask_zero": false, "trainable": false, "output_dim": 300, "embeddings_constraint": null, "embeddings_regularizer": null, "input_length": 40, "batch_input_shape": [null, 40]}, "class_name": "Embedding"}, {"config": {"padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "strides": [1], "kernel_size": [5], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv1d_3", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "trainable": true, "filters": 64}, "class_name": "Conv1D"}, {"config": {"rate": 0.2, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "strides": [1], "kernel_size": [5], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv1d_4", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "trainable": true, "filters": 64}, "class_name": "Conv1D"}, {"config": {"name": "global_max_pooling1d_2", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"rate": 0.2, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_4", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.2, "name": "dropout_6", "trainable": true}, "class_name": "Dropout"}, {"config": {"beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_2", "beta_regularizer": null, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "dtype": "int32", "input_dim": 95597, "name": "embedding_5", "mask_zero": false, "trainable": true, "output_dim": 300, "embeddings_constraint": null, "embeddings_regularizer": null, "input_length": 40, "batch_input_shape": [null, 40]}, "class_name": "Embedding"}, {"config": {"activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "use_bias": true, "dropout": 0.2, "bias_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "activation": "tanh", "go_backwards": false, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "implementation": 0, "recurrent_dropout": 0.2, "stateful": false, "return_sequences": false}, "class_name": "LSTM"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "dtype": "int32", "input_dim": 95597, "name": "embedding_6", "mask_zero": false, "trainable": true, "output_dim": 300, "embeddings_constraint": null, "embeddings_regularizer": null, "input_length": 40, "batch_input_shape": [null, 40]}, "class_name": "Embedding"}, {"config": {"activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "use_bias": true, "dropout": 0.2, "bias_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "activation": "tanh", "go_backwards": false, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "implementation": 0, "recurrent_dropout": 0.2, "stateful": false, "return_sequences": false}, "class_name": "LSTM"}], "class_name": "Sequential"}], "dot_axes": -1, "output_shape_type": "raw", "arguments": {}, "output_mask": null, "output_shape": null}, "class_name": "Merge"}, {"config": {"beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_3", "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_5", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"shared_axes": null, "name": "p_re_lu_1", "trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "PReLU"}, {"config": {"rate": 0.2, "name": "dropout_7", "trainable": true}, "class_name": "Dropout"}, {"config": {"beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_4", "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_6", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"shared_axes": null, "name": "p_re_lu_2", "trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "PReLU"}, {"config": {"rate": 0.2, "name": "dropout_8", "trainable": true}, "class_name": "Dropout"}, {"config": {"beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_5", "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_7", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"shared_axes": null, "name": "p_re_lu_3", "trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "PReLU"}, {"config": {"rate": 0.2, "name": "dropout_9", "trainable": true}, "class_name": "Dropout"}, {"config": {"beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_6", "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_8", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"shared_axes": null, "name": "p_re_lu_4", "trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "PReLU"}, {"config": {"rate": 0.2, "name": "dropout_10", "trainable": true}, "class_name": "Dropout"}, {"config": {"beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_7", "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_9", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"shared_axes": null, "name": "p_re_lu_5", "trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "PReLU"}, {"config": {"rate": 0.2, "name": "dropout_11", "trainable": true}, "class_name": "Dropout"}, {"config": {"beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_8", "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_10", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.4", "class_name": "Sequential"}